Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ཡང་དེ་ལྟར་ཁྱོད་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། བལྟ་བ་དང་བསྙེན་བཀུར་བ་དང་། གདམས་ངག་མ་ནོར་བར་བླང་བ་དང་། དེའི་ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བའི་ཚུལ་ལ་བརྩོན་པར་བྱེད་པས་ཡོངས་སུ་མི་སྐྱོ། ཕྱིར་མི་ལྡོག །
en: “In that way, you go before kalyāṇamitras, gaze upon them, honor them, receive their teaching without error, and are dedicated to the practice of its qualities that is unwearied, irreversible, and never disheartened.

source: སྒྱིད་ལུག་པར་མི་འགྱུར་ཏེ། ཁྱོད་ལ་བགེགས་སམ། བར་དུ་གཅོད་པའམ། སྒྲིབ་པ་གང་གིས་ཀྱང་མྱི་ཚུགས་ཏེ།
en: You are unaffected by any hindrance, obstacle, or obscuration whatsoever.

source: བདུད་དམ་བདུད་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་རྣམས་ཀྱང་མདུན་ན་གནས་པ་མེད་པས་དེའི་ཕྱིར་ཁྱོད་ནི་རིང་པོར་མི་ཐོགས་པར་སེམས་ཅན་ཐམས་ཅད་དགའ་བར་བྱེད་པར་འགྱུར་རོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Neither Māra nor the māra class of deities are present before you, and therefore you will soon bring happiness to all beings.”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་འགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མེད་པའི་དཔལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་ཁྱོད་ཀྱིས་ཇི་སྐད་དུ་སྨྲས་པ་དེ་ལྟར་འགྱུར་རོ། །ལྷ་མོ་ཁོ་བོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གདུང་བ་རྣམ་པར་ཞི་བས་དགའ་བར་འགྱུར་ཏེ།
en: The head merchant’s son, Sudhana, said to Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, “Goddess, I gain the highest delight in ending the torment of the kleśas for all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་ཉམ་ང་བའི་རྣམ་པར་སྨྱིན་པའི་ཕྱིར་ལྡོག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་འགྲུབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ལ་ནན་ཏན་ཏུ་བྱེད་པས་དགའ་བ་དམ་པ་ཉམས་སུ་ཚོར་བར་འགྱུར་རོ། །
en: I gain the highest delight in repelling dreadful karma for all beings, in bringing happiness to all beings, and in making all beings practice faultless actions.

source: ནམ་སེམས་ཅན་དེ་དག་ལས་དང་ཉོན་མོངས་པ་རྣམ་པ་སྣ་ཚོགས་མྱི་བདེ་བའི་སྦྱོར་བས་སེམས་རྣམ་པར་འཁྲུགས་ཤིང་ངན་སོང་དུ་ལྟུང་བར་འགྱུར་བའམ།
en: Bodhisattvas become very unhappy when beings engage in the unhappiness of various kinds of karma and kleśas, which disturbs their minds and causes them to fall into the lower existences.

source: བདེ་བའི་རྒྱུད་ན་གནས་ཀྱང་ལུས་དང་སེམས་ཀྱི་སྡུག་བསྔལ་དང་ཡིད་མྱི་བདེ་བ་སྣ་ཚོགས་ཉམས་སུ་མྱོང་བར་གྱུར་ཅིང་། མི་དགའ་བར་གནས་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཤིན་ཏུ་ཡིད་མི་བདེ་བར་འགྱུར་རོ། །
en: Even if those beings remain in happier existences, they experience physical and mental sufferings and various kinds of unhappiness and remain in a state of sorrow.

source: ལྷ་མོ་འདི་ལྟ་སྟེ། དཔེར་ན། མི་ཤིན་ཏུ་ངང་གིས་བྱམས་པ་ཞིག་ལ་བུ་གཅིག་པ་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་ཞིག་བདོག་པར་གྱུར་ལ།
en: “Goddess, it is like if a very loving father who has a beloved, beautiful son sees the limbs and smaller parts of his son’s body being cut off.

source: དེའི་ཡན་ལག་དང་ཉིང་ལག་བཅད་པ་ཞིག་མཐོང་ན་ཤིན་ཏུ་ངང་གིས་བྱམས་པའི་ཕྱིར་རབ་ཏུ་ཡིད་མི་བདེ་ཞིང་མྱི་དགའ་བར་འགྱུར་རོ། །
en: Because he is so loving, he becomes extremely unhappy and sorrowful.

source: ལྷ་མོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་འང་སེམས་ཅན་རྣམས་ལས་དང་ཉོན་མོངས་པའི་དབང་གིས་ངན་སོང་གསུམ་གྱི་རྒྱུད་དུ་ལྷུང་བ་ཞིག་མཐོང་ན་རབ་ཏུ་མི་དགའ་ལ་ཤིན་ཏུ་ཉམས་མི་བདེ་བར་འགྱུར་རོ། །
en: “Goddess, in the same way, when a bodhisattva who is engaged in bodhisattva conduct sees beings falling into the three lower existences through the power of their karma and kleśas, the bodhisattva becomes extremely unhappy and sorrowful.

source: གང་གི་ཚེ་སེམས་ཅན་རྣམས་ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པ་ཡང་དག་པར་ལེན་པའི་རྒྱུས་ལུས་ཞིག་ནས་བདེ་བའི་རྒྱུད་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་གྱུར་ཏམ། ལྷ་དང་མིའི་ལམ་གྱི་རྒྱུད་དུ་ལུས་དང་སེམས་ཀྱི་བདེ་བ་ཉམས་སུ་མྱོང་བ་ཞིག་ཏུ་གྱུར་ན། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་བདེ་བ་དང་ལྡན་ཞིང་། ཉམས་བདེ་བ་དང་ཡིད་དགའ་བ་དང་། རབ་ཏུ་སྤྲོ་བ་དང་།
en: “The bodhisattvas are happy, glad, joyful, delighted, and pleased when beings are reborn into happy existences when their bodies are destroyed, or when they experience physical and mental happiness in a divine or human existence as the result of their having adopted good physical, vocal, and mental conduct.

source: དགའ་བའི་ཡིད་ཉམས་སུ་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ། །ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདག་གི་དོན་གྱི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་ཅིང་དོན་དུ་གཉེར་བ་མ་ཡིན་ཏེ། འཁོར་བའི་དགའ་བ་དང་། བདེ་བ་སྣ་ཚོགས་ཉམས་སུ་མྱོང་བར་བྱ་བའི་ཕྱིར་མ་ཡིན།
en: “Goddess, the bodhisattvas do not aspire to and are not dedicated to omniscience for their own sake or in order to experience the various joys and pleasures of saṃsāra.

source: འདོད་པའི་ཁམས་སུ་གཏོགས་པའི་དགའ་བ་རྣམ་པ་ཐ་དད་པར་སྣ་ཚོགས་དོན་དུ་གཉེར་བས་མ་ཡིན།
en: It is not from dedication to the various different kinds of joys within the desire realm.

source: འདུ་ཤེས་དང་སེམས་དང་ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་བའི་དབང་གིས་མ་ཡིན། ཀུན་ཏུ་སྦྱོར་བ་དང་།
en: It is not through the power of mistaken perception, motivation, or views.

source: འཆིང་བ་དང་། བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་འཁོར་བའི་དབང་དུ་གྱུར་པས་མ་ཡིན།
en: It is not through the power of involvement, bondage, predispositions, or being overwhelmed.

source: སྲེད་པ་དང་ལྟ་བའི་དབང་དུ་གྱུར་པས་མ་ཡིན།
en: It is not through the power of the view of craving.

source: སེམས་ཅན་སྣ་ཚོགས་དང་འདུ་ཞིང་འཛི་བའི་དགའ་བའི་འདུ་ཤེས་ཀྱིས་སེམས་རྣམ་པར་འཕེལ་བས་མ་ཡིན།
en: It is not through the increase of a mind that conceives of the joys of crowds and the gatherings of various beings.

source: བསམ་གཏན་གྱི་དགའ་བ་དང་བདེ་བ་མྱོང་བ་ཡོངས་སུ་ཆགས་པས་མ་ཡིན།
en: It is not through attachment to the experiences of the joy and bliss of dhyāna.

source: སྒྲིབ་པ་སྣ་ཚོགས་ཀྱིས་བསྒྲིབས་ཤིང་འཁོར་བའི་རྒྱུད་ན་འགྲོ་ལྡོག་པ་མ་ཡིན་གྱི།
en: It is not going around and around in the continuity of saṃsāra while being obscured by various obscurations.

source: ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་འཁོར་བའི་རྒྱ་མཚོ་ན་འཁོད་ཅིང་། སྡུག་བསྔལ་དཔག་ཏུ་མྱེད་པས་ཤིན་ཏུ་མནར་བ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་ཅིང་།
en: “Goddess, the bodhisattvas have great compassion for beings who are in the ocean of saṃsāra and who are tormented by immeasurable sufferings.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབས་ཏེ།
en: They make great prayers to gather to themselves all beings.

source: དེ་དག་སྙིང་རྗེ་ཆེན་པོས་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་ཤུགས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་བརྩོན་ཞིང་འཁོར་བ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་སྣང་ངོ་། །
en: Through the power of having made those prayers with great compassion, they are dedicated to ripening and guiding beings, and they appear carrying out bodhisattva conduct in saṃsāra.

source: དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་དོན་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྒྲིབ་པ་མེད་པ་ཡོངས་སུ་ཚོལ་ཞིང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ། །
en: In order to eliminate all the obscurations of beings, they seek the unobscured wisdom of omniscience and make prayers to serve and make offerings to all the tathāgatas.

source: དེ་དག་དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་སྨོན་ལམ་གྱི་དབང་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་ཡོངས་སུ་སྐྱོ་བ་མྱེད་དེ།
en: Through the power of their prayers to serve and make offerings to all the tathāgatas, they are never disheartened in their practice of bodhisattva conduct.

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པའི་ཚེ། ཀུན་ནས་ཉོན་མོངས་པའི་ཞིང་མཐོང་ན། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ། །
en: When they are practicing bodhisattva conduct and see a realm that is completely defiled, they make the prayer to purify all buddha realms.

source: ཀུན་ནས་ཉོན་མོངས་པའི་ཞིང་ཡོངས་སུ་སྦྱོང་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་མཆེད་སྣ་ཚོགས་མཐོང་བར་གྱུར་པའི་ཚེ། ཆོས་ཀྱི་སྐུ་ཐ་དད་པ་མེད་ཅིང་བླ་ན་མྱེད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ། །
en: When they are purifying defiled realms and see the various āyatanas of all beings, they make the prayer to purify the Dharma body that is undifferentiated and unsurpassable.

source: སེམས་ཅན་རྣམས་ཀྱི་ལུས་དང་ངག་དང་སེམས་ཀུན་ནས་ཉོན་མོངས་པ་དང་ལྡན་པར་མཐོང་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་རྒྱན་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ། །
en: When they see the defiled bodies, speech, and minds of beings, they make the prayer to purify the bodies, speech, and minds that adorn all beings.

source: སེམས་ཅན་སྐྱེ་མཆེད་མ་ཚང་བ་དང་། སེམས་ཡོངས་སུ་མ་དག་པ་མཐོང་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་ཡོངས་སུ་སྦྱོང་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པས་ཡོངས་སུ་སྐྱོ་བ་མེད་དོ། །
en: When they see the incomplete āyatanas and impure minds of beings, they purify the minds and conduct of all beings and are never disheartened in carrying out bodhisattva conduct.

source: ལྷ་མོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་སེམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཐའ་དང་དབུས་མེད་པ་ལ་སྤྱོད་དེ།
en: “Goddess, in that way, with minds that are never disheartened, the bodhisattvas carry out vast bodhisattva conduct without end or middle.

source: དེ་ལྟར་སྤྱོད་པ་ནི་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་བསྐྱེད་པས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་རྒྱན་དུ་གྱུར་པ་ཡིན།
en: With that kind of conduct they are adornments of the world because they create the good fortune of devas and humans.

source: བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལ་རབ་ཏུ་འགོད་པའི་ཕྱིར་ཕ་དང་མར་གྱུར་པ་ཡིན།
en: They are like parents because they establish beings in the aspiration for enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་དུ་འཛུད་པས་མ་མ་ལྟ་བུར་གྱུར་པ་ཡིན།
en: They are like nurses because they bring beings onto the bodhisattva path.

source: ངན་སོང་གི་གཡང་སའི་འཇིགས་པ་ལས་བསྲུང་བའི་ཕྱིར་ལྷན་ཅིག་སྐྱེས་པའི་ལྷ་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བ་ལྟ་བུར་གྱུར་པ་ཡིན།
en: They are like connate deities, who are deities that always accompany a being because they protect beings from the terror of the abyss of the lower existences.

source: འཁོར་བའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བའི་ཕྱིར་མཉན་པ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་ཡིན།
en: They are like great ferrymen because they free beings from the ocean of saṃsāra.

source: བདུད་དང་ཉོན་མོངས་པའི་འཇིགས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་ཕྱིར་སྐྱབས་སུ་གྱུར་པ་ཡིན།
en: They are refuges because they repel all the terrors of the māras and kleśas.

source: ཤིན་ཏུ་བསིལ་བའི་རང་བཞིན་ཉེ་བར་སྟོབས་པས་གནས་སུ་གྱུར་པ་ཡིན།
en: They are shelters because they bring beings to a state of complete tranquility.

source: སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་འཇུག་པར་བྱེད་པས་མུ་སྟེགས་སུ་གྱུར་པ་ཡིན།
en: They are bathing places because they bring beings into the ocean of all buddhas.

source: ཆོས་རིན་པོ་ཆེའི་གླིང་དུ་སྐྱེལ་བས་མགོན་བྱེད་པར་གྱུར་པ་ཡིན།
en: They are protectors because they escort beings to the island of the jewels of the Dharma.

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་མེ་ཏོག་གིས་སེམས་ཡོངས་སུ་རྒྱས་པར་བྱེད་པས་མེ་ཏོག་ཏུ་གྱུར་པ་ཡིན།
en: They are flowers because their minds have blossomed with all the qualities of buddhahood.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་འོད་ཡངས་པ་རབ་ཏུ་འགྱེད་པས་རྒྱན་དུ་གྱུར་པ་ཡིན།
en: They are adornments because they radiate the light of merit and wisdom.

source: ཀུན་ནས་མཛེས་པས་དགའ་བ་དང་བདེ་བ་དམ་པ་བྱེད་པ་ཡིན།
en: They bring the highest delight and happiness because they are beautiful.

source: ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ལ་ནན་ཏན་ཏུ་བྱེད་པས་ཕྲད་ན་ལེགས་པ་ཡིན།
en: They are excellent to meet because they are dedicated to faultless actions.

source: ཡན་ལག་དམ་པ་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་ཚང་བའི་ལུས་དང་ལྡན་པས་ཀུན་ཏུ་བཟང་བ་ཡིན།
en: They are completely good because they possess bodies that are complete in having all aspects of excellent limbs.

source: བལྟ་ན་མྱི་མཐུན་པ་མྱེད་པས་གཏང་མི་བྲ་བའི་གཟུགས་དང་ལྡན་པ་ཡིན།
en: They have charming forms because the sight of them is without anything disagreeable.

source: ཡེ་ཤེས་ཀྱི་འོད་ཟེར་རབ་ཏུ་འགྱེད་པའི་ཕྱིར་འོད་བྱེད་པ་ཡིན།
en: They bring light because they radiate the light rays of wisdom.

source: ཆོས་ཀྱི་སྒྲོན་མ་འཛིན་པའི་ཕྱིར་སྣང་བ་བྱེད་པ་ཡིན།
en: They bring illumination because they hold the torch of the Dharma.

source: བྱང་ཆུབ་ཀྱི་བསམ་པ་ཡོངས་སུ་དག་པར་བྱེད་པའི་ཕྱིར་གསལ་བར་བྱེད་པ་ཡིན།
en: They bring clarity because they purify the motivation for enlightenment.

source: བདུད་ཀྱི་ལས་རྣམ་པར་བཟློག་པའི་ཕྱིར་དམག་དཔོན་དུ་གྱུར་བ་ཡིན།
en: They are generals because they repel the activities of the māras.

source: ཤེས་རབ་ཀྱི་འོད་གཟེར་གྱི་དྲ་བ་རབ་ཏུ་སྣང་བ་འགྱེད་པའི་ཕྱིར་ཉི་མར་གྱུར་པ་ཡིན།
en: They are suns because they radiate a net of the light rays of wisdom.

source: ཆོས་ཀྱི་ནམ་མཁའ་ལ་བློའི་ཟླ་བ་འཆར་བར་བྱེད་པས་ཟླ་བར་གྱུར་པ་ཡིན།
en: They are moons because they rise as moons of realization in the sky of the Dharma.

source: འགྲོ་བ་ཐམས་ཅད་དུ་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོའི་ཆར་འབབས་པས་སྤྲིན་དུ་གྱུར་པ་ཡིན་ཏེ།
en: They are clouds because they send down rain from great clouds of Dharma onto all beings.

source: ལྷ་མོ་དེ་ལྟར་ནན་ཏན་དུ་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་བ་ཡིན་ནོ། །
en: “Goddess, the bodhisattvas who practice in that way are a delight for all beings.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མེད་པའི་དཔལ་ཁྱིམ་གྱི་ལྷ་མོ་སྟོང་ཕྲག་བཅུ་དང་བཅས་པས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། བདུག་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་དང་། རིན་པོ་ཆེའི་རྒྱན་གྱི་ཆར་ཡིད་ཀྱི་རང་བཞིན་མངོན་པར་ཕབ་སྟེ། ཀུན་ནས་བསྐོར་ཅིང་རྗེས་སུ་འབྲངས་ནས།
en: Then Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, together with ten thousand goddesses of the home, sent down onto Sudhana, the head merchant’s son, a rain of flowers, garlands, incense, powders, ointments, and precious jewelry that transcended divine materials.

source: བྱང་ཆུབ་སེམས་དཔའི་ཁང་པར་འགྲོ་བའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །བྱང་ཆུབ་རྫོགས་པར་ཐུགས་བསྐྱེད་ཅིང་། །སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེ་བས། །རྒྱལ་བ་ཡེ་ཤེས་ཉི་མ་རྣམས། །བར་འགའ་ཞིག་ན་འཇིག་རྟེན་འབྱུང་། །
en: Encircling him and following him as he entered the assembly hall of the bodhisattvas, they praised him with these verses: “Having developed the aspiration for enlightenment Out of love for all beings, The jinas, the suns of wisdom, Sometimes appear in the world.

source: བསྐལ་པ་བྱེ་བ་མང་པོས་ཀྱང་། །ཁྱོད་ཀྱི་ཞལ་མཐོང་ཤིན་ཏུ་དཀའ། །
en: {1} “Even in many millions of kalpas It is difficult to see your face.

source: འཇིག་རྟེན་མ་རིག་མདོངས་པ་ལ། །ཁྱོད་ཀྱི་ཡེ་ཤེས་གཉི་ཆེན་ཡིན། །
en: Your wisdom is a great sun In the world blinded by ignorance.

source: མྱི་ཤེས་རབ་རིབ་བསྒྲིབས་པ་ཡི། །འཇིག་རྟེན་ཕྱིན་ཅི་ལོག་གཟིགས་ནས། །ཐུགས་རྗེ་ཆེན་པོ་རབ་བསྐྱེད་དེ། །ཁྱོད་ནི་རང་བྱུང་ཉིད་དུ་ཞུགས། །
en: {2} “Great compassion arose in you When you saw the world in error, Obscured by the darkness of unknowing, And you spontaneously appeared in it and remained.

source: ཁྱོད་ཀྱི་དགོངས་པ་རྣམ་དག་པས། །སངས་རྒྱས་བྱང་ཆུབ་དོན་དུ་བརྩོན། །དགེ་བཤེས་བསྙེན་བཀུར་བསྟེན་མཛད་ཅིང་། །
en: {3} “With your pure motivation, you are dedicated To attaining the enlightenment of buddhahood.

source: ལུས་སྲོག་ཕངས་པར་མཛད་མི་མངའ། །
en: You serve and depend on kalyāṇamitras Without regard for your own body and life.

source: ཁྱོད་ནི་འཇིག་རྟེན་རྟེན་མི་མངའ། །
en: {4} “You have no reliance on this world.

source: འདུ་འཛི་མི་མངའ་གནས་མི་མངའ། །
en: You have no location and no preoccupations.

source: འདྲེས་པ་མ་མཆིས་མི་རྟེན་པས། །
en: You have no entanglements and no abode.

source: དགོངས་པ་ཐོགས་མེད་ནམ་མཁའ་བཞིན། །
en: Your motivation is like space, without impediment.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་མཛད་ཅིང་། །བསོད་ནམས་དཀྱིལ་འཁོར་འོད་བཟང་བས། །ཡེ་ཤེས་སྒྲོན་མ་རབ་འགྱེད་པ། །འཇིག་རྟེན་ཚད་མེད་ཀུན་ཏུ་འཆར། །
en: {5} “As you practice bodhisattva conduct With the brilliant light of a field of merit, Your radiant torch of wisdom Shines within countless worlds.

source: འཇིག་རྟེན་ནས་ཀྱང་འཕགས་མི་མཛད། །འཇིག་རྟེན་ཆོས་ཀྱིས་ཡོང་མྱི་འགོ། །
en: {6} “You are not above the world, But you are unstained by worldly qualities.

source: ཆགས་པ་མེད་པར་འཇིག་རྟེན་སྤྱོད། །མཁའ་ལ་སེར་བུ་ཇི་བཞིན་ནོ། །
en: You act in the world without impediment, Like the breezes moving through the sky.

source: བསྐལ་པའི་མེ་འབར་མེ་བཞིན་དུ། །རྟག་ཏུ་འབར་བས་རབ་ཏུ་བརྩོན། །
en: {7} “You are dedicated to constantly blazing Like the burning at the kalpa’s end.

source: མེ་ལྟ་བུ་ཡི་བརྩོན་འགྲུས་ཀྱིས། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པར་མཛད། །
en: You practice the bodhisattva conduct With the ardor of the fire that ends a kalpa.

source: སེང་གེ་བཞིན་དུ་ཤིན་ཏུ་དཔའ། །
en: {8} “You have great courage, like a lion.

source: བརྩོན་འགྲུས་རྣམ་པར་གནོན་པ་བརྟན། །ཡེ་ཤེས་རྣམ་པར་གནོན་དང་ལྡན། །གཞན་གྱིས་ཐུབ་པ་མེད་པར་སྤྱོད། །
en: With strong, diligent prowess You have attained the prowess of wisdom With a practice that is invincible.

source: ཆོས་དབྱིངས་རྒྱ་མཚོ་འདི་དག་ན། །རྒྱ་མཚོའི་ཚུལ་རྣམས་ཇི་སྙེད་པ། །དེར་ཡང་དགེ་བཤེས་བསྙེན་བཀུར་བས། །དཔའ་བོ་ཁྱོད་ནི་འཇུག་པར་འགྱུར། །
en: {9} “Through honoring the kalyāṇamitras, You, here, have entered into The ocean of all the different ways Within the ocean of the realm of the Dharma.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མེད་པའི་དཔལ་གྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ། དེ་འགྲོ་བའི་ཕྱི་བཞིན་ཆོས་འདོད་པའི་དོན་དུ་འབྲང་བར་གྱུར་ཏོ། །
en: {10} In that way, Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, praised in verse Sudhana, the head merchant’s son, while following him out of a yearning for the Dharma.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བགྲོ་བའི་ཁང་པ་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་སྣང་བའི་འོད་དུ་ཕྱིན་ཏེ།
en: Sudhana, the head merchant’s son, went into the assembly hall of the bodhisattvas called the Illuminating Light of the Realm of the Dharma.

source: ནང་དུ་སོང་ནས་ཤཱཀྱའི་བུ་མོ་གོ་བ་མཐོང་བར་འདོད་དེ་ཀུན་ཏུ་བལྟས་ན་ཤཱཀྱའི་བུ་མོ་གོ་པ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བགྲོ་བའི་ཁང་པ་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་སྣང་བའི་འོད་ཀྱི་དབུས་ན།
en: When he had entered, wishing to find the Śākya maiden Gopā, he looked everywhere.

source: སྟན་རིན་པོ་ཆེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གནས་སྣང་བར་བྱེད་པའི་གཟུགས་བརྙན་གྱི་པདྨོའི་སྙིང་པོ་ཅན་ཞིག་ལ་བུད་མེད་རྒྱལ་པོའི་རིགས་སུ་བྱུང་བ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་དགེ་བའི་རྩ་བའི་སྐལ་བ་མཉམ་པ། སྔོན་སྦྱིན་པའི་ཡོངས་སུ་བསྡུ་བས་ཤིན་ཏུ་བསྡུས་པ། ཚིག་སྙན་ཅིང་འཇམ་པར་སྨྲ་བའི་ངང་ཚུལ་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ། དོན་མངོན་དུ་བྱ་བས་ཤིན་ཏུ་བསྡུས་པ།
en: He saw the Śākya maiden Gopā in the center of the assembly hall of the bodhisattvas called the Illuminating Light of the Realm of the Dharma.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་བསྒྲུབ་པ་ལ་དོན་མཐུན་པས་ཤིན་ཏུ་བཟུང་བ། སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བས་བུ་དང་བུ་མོ་ཡོངས་སུ་གཟུང་བའི་ཚུལ་བཅངས་པ། བྱམས་པ་ཆེན་པོ་དང་ལྡན་པའི་རང་གི་ཁྱིམ་ཐབ་ཀྱི་རྗེས་སུ་འབྲང་བ་ཡོངས་སུ་དག་པར་བྱས་པ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་མཁས་པ། བསམ་གྱིས་མྱི་ཁྱབ་པས་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ།
en: She was seated upon a precious throne that had in its center a lotus with a form that illuminated all the abodes of bodhisattvas, and she was encircled by an entourage of eighty-four thousand women of royal families, who all had equally the roots of merit from the past practice of bodhisattva conduct; who in the past had attracted gatherings of beings through acts of generosity; who had a way of speaking with pleasant and gentle words; who cared for beings through causing them to focus on the goal of omniscience; who cared for beings in accord with the realizations of the buddhas and the bodhisattvas; who with all actions inspired by great compassion cared for beings as if they were their sons and daughters; who with great love followed and purified their spouses; and who in the past ripened beings through the inconceivable skillful methods of bodhisattvas.

source: སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་འཁོར་གྱིས་ཀུན་ནས་བསྐོར་ཅིང་འདུག་པ་མཐོང་ངོ་། །བུད་མེད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མྱི་ལྡོག་པ་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་ལ་ཞུགས་པ།
en: Those eighty-four thousand women followed the way of the perfections of bodhisattvas who were progressing irreversibly toward the highest, complete enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ།
en: They followed the bodhisattva training without expectation of reward from others.

source: ཆགས་པ་ཐམས་ཅད་དང་བྲལ་བའི་སེམས་དང་ལྡན་པ།
en: They had minds free from all attachment.

source: འཁོར་བའི་དགའ་བ་ཐམས་ཅད་ཀྱིས་སྐྱོ་བའི་ཡིད་དང་ལྡན་པ།
en: They were disillusioned by all the delights of saṃsāra.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཆགས་པ་མེད་པས་ཡོངས་སུ་དག་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མངོན་དུ་བྱ་བའི་སེམས་ཀྱི་ཤུགས་དང་ལྡན་པ།
en: They had purified without impediment all the ways in the realm of the Dharma. They had the power of the motivation directed toward omniscience.

source: སྒྲིབ་པ་དང་བར་དུ་གཅོད་པའི་དྲ་བ་དང་བྲལ་བ།
en: They were free from the net of obscurations and obstacles.

source: ཆགས་པའི་ལམ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ།
en: They had transcended all the paths of attachment.

source: ཆོས་ཀྱི་སྐུ་ལ་ལེགས་པར་སྤྲུལ་པས་རྣམ་པར་སྤྱོད་པ།
en: They were active through emanations of their Dharma bodies.

source: འཇིག་རྟེན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་མངོན་པར་ཕྱོགས་པ།
en: They were focused on ripening and guiding all worlds.

source: བསོད་ནམས་རྒྱ་མཚོ་དྲི་མ་མེད་པས་ཡོངས་སུ་བྱུང་བའི་སེམས་དང་ལྡན་པ།
en: They had minds in which a stainless ocean of merit had arisen.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་ཤིན་ཏུ་བྱུང་བ།
en: They had become what they were because of their completely good bodhisattva prayers and conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་ཤུགས་ཡངས་པས་ཡེ་ཤེས་ཀྱི་ཉི་མའི་དཀྱིལ་འཁོར་གྱིས་སེམས་རབ་ཏུ་སྣང་བ་ཡང་དག་པར་བསྐྱེད་པ་ཤ་སྟག་གོ །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཤཱཀྱའི་བུ་མོ་གོ་པ་གང་ན་བ་དེར་ཕྱིན་ནས། ཤཱཀྱའི་བུ་མོ་གོ་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལངས་ནས་མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཁོར་བ་ན་ཡོངས་སུ་འཁོར་ཡང་འཁོར་བའི་སྐྱོན་གྱིས་མི་གོས་པ་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་རང་བཞིན་ཡང་ཁོང་དུ་ཆུད་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་ཡང་མི་གནས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སྣང་བ་ཡང་རབ་ཏུ་ཐོབ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་རྒྱུན་མི་གཅོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་ཡང་རབ་ཏུ་གནས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཡང་ཡོངས་སུ་སྟོན་པ་དང་།
en: They had increased the vast power of the strengths of bodhisattvas.

source: འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ལས་ཀྱང་ཡོངས་སུ་འདས་ལ།
en: And their minds had become illuminating like the disk of the sun.

source: འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་ཡང་ཉེ་བར་སྤྱོད་པ་དང་། ཆོས་ཀྱི་ལུས་ཡོངས་སུ་གྲུབ་པ་དང་ལྡན་ཡང་། གཟུགས་ཀྱི་ལུས་ཁ་དོག་མཐའ་ཡས་པའང་མངོན་པར་སྒྲུབ་པ་དང་། མཚན་མ་མེད་པའི་ཆོས་ཀྱི་སྐུ་ལ་ཡང་རབ་ཏུ་གཞོལ་ལ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དང་དབྱིབས་ཀྱི་ལུས་ཀྱང་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ཐམས་ཅད་བརྗོད་དུ་མ་མཆིས་པར་ཡང་རབ་ཏུ་རྟོགས་ལ། ངག་གི་ལམ་དང་ངེས་པའི་ཚིག་ཐམས་ཅད་བརྗོད་པས་ཀྱང་། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་དང་།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the Śākya maiden and then stood before her, his hands placed together in homage, and said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas continue within saṃsāra without being stained by saṃsāra; how they realize the equal nature of all phenomena but do not dwell on the level of the śrāvakas and pratyeka­buddhas; how they attain the illumination of the Dharma of the buddhas and yet continue with their bodhisattva conduct; how they dwell on the level of a bodhisattva but teach the scope of knowledge of the tathāgatas; how they transcend all worldly existences but are active within all worldly existences; how they accomplish a body of the Dharma but also accomplish form bodies of infinite colors; how they attain the Dharma body that has no characteristics but manifest bodies with the colors and shapes of all beings; and how they realize that all Dharmas cannot be described but teach the Dharma to all beings, describing them with all ways of speaking and definitions.
